app/Http/Controllers/BranchController.php

    public function all(){
        return response(Branch::all());
---
select * from `branch`