app/Http/Controllers/CartController.php

    public function cartList(){
        $disk = (env('APP_ENV') == 'production')?'s3':'local';
        $user_id = Auth::user()->id;
        $product = Cart::with(['menu'=> function ($query) {
                $query->withTrashed();
            }, 'menu.menuPictures', 'menu.menuType'])
            ->where('user_id', '=', $user_id)
            ->get();
---
select * from `cart` where `user_id` = '23'
select * from `menu_picture` where `menu_picture`.`menu_id` in ('1', '2', '3')
select * from `menu_type` where `menu_type`.`id` in ('1')
select * from `menu` where `menu`.`id` in ('1', '2', '3')

    public function add($id, Request $req){
        $auth_user = Auth::user();
        if ($auth_user->carts()->where('menu_id','=', $id)->first() == null) {
            $newCartList = Cart::create([
                'user_id'=>Auth::user()->id,
                'menu_id'=>$id,
                'quantity'=>$req->input('quantity')
            ]);
        } else {
            DB::table('cart')
                ->where('user_id', $auth_user->id)
                ->where('menu_id', $id)
                ->increment('quantity', $req->input('quantity'));
---
update `cart` set `quantity` = `quantity` + 1 where `user_id` = '23' and `menu_id` = '2'
update `menu` set `hits` = `hits` + 1 where `id` = '2'