app/Http/Controllers/CheckoutController.php

select * from `cart` where `user_id` = '23'
select * from `menu` where `menu`.`id` in ('1', '2', '3')
select * from `provinces`
select * from `provinces` where `provinces`.`id` in ('59')
select * from `sub_districts` where `sub_districts`.`id` in ('5996')
select * from `users` where `users`.`id` = '23' limit 1
---
    public function checkout(){
        $user_id = Auth::user()->id;
        $product = Cart::with(['menu'])
            ->where('user_id', '=', $user_id)
            ->get();
        if($product->isEmpty()) return redirect('/');

        $provinces = Province::all();
        $user = User::with(['subDistrict', 'subDistrict.district', 'subDistrict.district.province'])
            ->find($user_id);

select * from `cart` where `user_id` = '23'
select * from `menu` where `menu`.`id` in ('1', '2', '3')
---
    public function process(Request $req){

        $user_id = Auth::user()->id;
        $product = Cart::with(['menu'])
            ->where('user_id', '=', $user_id)
            ->get();

delete from `cart` where `user_id` = '23'
---
            OrderMenu::insert($insert);
        }

        DB::table('cart')
            ->where('user_id', $user_id)
            ->delete();