app/Http/Controllers/HistoryBackController.php

select * from `order_status` order by `code` asc
select * from `branch`
select * from `order` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `order`
---
    public function show(){
        $status = OrderStatus::orderBy('code', 'asc')->get();
        $branches = Branch::all();
        $orders = Order::with(['orderStatus'])
            ->orderBy('created_at', 'DESC')
            ->paginate(10);

select * from `order_status` order by `code` asc
select * from `branch`
select count(*) as aggregate from `order` where `id` = 'dfg'
---
    public function find(Request $req){
        $status = OrderStatus::orderBy('code', 'asc')->get();
        $branches = Branch::all();
        $orders = Order::with(['orderStatus'])
            ->where('id', '=', $req->input('order_id'))
            ->orderBy('created_at', 'DESC')
            ->paginate(10);

select * from `menu_picture` where `menu_picture`.`menu_id` in ('2', '58', '59')
select * from `menu` where `menu`.`id` in ('2', '58', '59')
select * from `order_menu` where `order_menu`.`order_id` in ('35')
select * from `order` where `id` = '35' limit 1
---
    public function order($id){
        $order = Order::with(['orderStatus', 'user', 'orderMenus', 'orderMenus.menu', 'orderMenus.menu.menuPictures'])
            ->where('id', "=", $id)
            ->first();

select * from `order_status` order by `code` asc
select * from `branch`
select * from `order_status` where `order_status`.`code` in ('2', '3', '5')
select * from `order` where `status_code` in ('1', '2', '3', '4', '5') and `branch_id` = '1' and date(`created_at`) >= '1995-07-05 00:00:00' and date(`created_at`) <= '2018-12-03 23:59:59' order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `order` where `status_code` in ('1', '2', '3', '4', '5') and `branch_id` = '1' and date(`created_at`) >= '1995-07-05 00:00:00' and date(`created_at`) <= '2018-12-03 23:59:59'
---
    public function search( $branch_id, $status_code, String $from, String $to, Request $req)
    {
        $status = OrderStatus::orderBy('code', 'asc')->get();
        $branches = Branch::all();

        $all_status_code = [];
        if ($status_code > 0) {
            $all_status_code[] = $status_code;
        }else {
            foreach ($status as $key => $value) {
                $all_status_code[] = $value->code;
            }
        }

        $all_branch_id = [];
        if ($branch_id > 0) {
            $all_branch_id[] = $branch_id;
        } else {
            foreach ($branches as $key => $value) {
                $all_branch_id[] = $value->id;
            }
        }

        $orders = Order::with(['orderStatus'])
            ->whereIn('status_code', $all_status_code)
            ->where(function($q) use($branch_id, $all_branch_id){
                if ($branch_id > 0) {
                    $q->where('branch_id', '=', $branch_id);
                } else {
                    $q->whereIn('branch_id',$all_branch_id)
                      ->orWhereNull('branch_id');
                }

            })
            ->whereDate('created_at', '>=',date($from . ' 00:00:00'))
            ->whereDate('created_at', '<=', date($to . ' 23:59:59'))
            ->orderBy('created_at', 'DESC')
            ->paginate(10);