app/Http/Controllers/HistoryController.php

    public function history(){
        $user_id = Auth::user()->id;
        $status = OrderStatus::orderBy('code', 'asc')->get();
        $orders = Order::with(['orderStatus'])
            ->where('user_id', '=', $user_id)
            ->orderBy('created_at', 'DESC')
            ->paginate(10);
---
select * from `order_status` order by `code` asc
select * from `order` where `user_id` = '23' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `order` where `user_id` = '23'