app/Http/Controllers/IndexController.php

select * from `menu` order by `updated_at` desc limit 6
select * from `menu_picture` where `menu_picture`.`menu_id` in ('1', '2', '3', '4', '57', '58')
select * from `menu_type` where `menu_type`.`id` in ('1', '8')
select * from `menu` order by `hits` desc limit 6
---
    public function index(){

        $new_menu = Menu::with('menuPictures', 'menuType')->orderBy('updated_at', 'desc')->take(6)->get();
        $top_menu= Menu::with('menuPictures', 'menuType')->orderBy('hits', 'desc')->take(6)->get();