app/Http/Controllers/ProductBackController.php

select * from `menu_picture` where `menu_picture`.`menu_id` in ('1', '2', '3', '4', '34')
select * from `menu_type` where `menu_type`.`id` in ('1', '2')
select * from `menu` limit 5 offset 0
select `tag`.*, `menu_tag`.`menu_id` as `pivot_menu_id`, `menu_tag`.`tag_id` as `pivot_tag_id` from `tag` inner join `menu_tag` on `tag`.`id` = `menu_tag`.`tag_id` where `menu_tag`.`menu_id` in ('1', '2', '3', '4', '34')
---
                break;

            default:
                $menus = Menu::with('tags', 'menuPictures', 'menuType')->paginate(5);

select * from `menu_picture` where `menu_picture`.`menu_id` in ('1')
select * from `menu_type` where `menu_type`.`id` in ('1')
select * from `menu` where `menu`.`id` = '1' limit 1
select `tag`.*, `menu_tag`.`menu_id` as `pivot_menu_id`, `menu_tag`.`tag_id` as `pivot_tag_id` from `tag` inner join `menu_tag` on `tag`.`id` = `menu_tag`.`tag_id` where `menu_tag`.`menu_id` in ('1')
---
    public function getProductDetailById(Request $req)
    {
        $id = $req->input('product_id');
        if ($id <= 0 || !is_numeric($id)) {
            abort(404);
        }
        $menu = Menu::with('tags', 'menuPictures', 'menuType')->find($id);