app/Http/Controllers/SalesController.php

select * from `branch`
select * from `menu_picture` where `menu_picture`.`menu_id` in ('1', '2', '3', '4', '34', '35', '36', '37', '38', '39', '40', '41', '43', '44', '49', '53', '56', '57', '58', '59')
select * from `menu_type` where `menu_type`.`id` in ('1', '2', '3', '4', '5', '8', '9')
select * from `menu` order by `hits` desc limit 20
---
    public function show(){
        $branches = Branch::all();
        $top_menu = Menu::with('menuPictures', 'menuType')->orderBy('hits', 'desc')->take(20)->get();

select * from `menu` where `menu`.`id` in ('1', '2', '3', '35', '56', '57', '58', '59')
select * from `order_menu` where `order_menu`.`order_id` in ('26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38')
select * from `order_status` where `order_status`.`code` in ('1', '2', '3', '5')
select * from `order` where `created_at` >= '1995-07-0500:00:00' and `created_at` <= '2018-12-0323:59:59' and `branch_id` >= '1'
---
    public function data(Request $req){
        $compare = '=';
        $from = $req->input('from');
        $to = $req->input('to');
        $branch_id = $req->input('branch_id');
        if ($branch_id <= 0) {
            $compare = '>=';
            $branch_id = 1;
        }
        $orders = Order::with(['orderStatus', 'orderMenus', 'orderMenus.menu'=> function ($query) {
                    $query->withTrashed();
                }])
                ->where('status_code', '=', 5)
                ->where('created_at', '>=', date($from . '00:00:00'))
                ->where('created_at', '<=', date($to . '23:59:59'))
                ->where('branch_id', $compare, $branch_id)
                ->get();

select * from `menu` where `menu`.`id` in ('1', '2', '3')
select * from `order_menu` where `order_menu`.`order_id` in ('40', '41')
select * from `order_status` where `order_status`.`code` in ('1')
select * from `order` where `created_at` >= '2018-12-03' and `branch_id` >= '1'
---
    public function todayStat(Request $req){
        $compare = '=';
        $branch_id = $req->input('branch_id');
        if ($branch_id <= 0) {
            $compare = '>=';
            $branch_id = 1;
        }
        $today_orders = Order::with(['orderStatus', 'orderMenus', 'orderMenus.menu'=> function ($query) {
                    $query->withTrashed();
                }])
                ->where('created_at', '>=', date('Y-m-d'))
                ->where('status_code', '=', 5)
                ->where('branch_id', $compare, $branch_id)
                ->get();