app/Http/Controllers/StoreController.php

select * from `menu_picture` where `menu_picture`.`menu_id` in ('35', '40', '48', '49', '51', '52', '57', '58')
select * from `menu_type` where `menu_type`.`id` in ('8')
select * from `menu` where exists (select * from `menu_type` where `menu`.`type_id` = `menu_type`.`id` and `name` like 'ของหวาน%') limit 9 offset 0
select count(*) as aggregate from `menu` where exists (select * from `menu_type` where `menu`.`type_id` = `menu_type`.`id` and `name` like 'ของหวาน%')
select * from `menu_picture` where `menu_picture`.`menu_id` in ('56', '57', '58', '59')
select * from `menu_type` where `menu_type`.`id` in ('3', '8', '9')
select * from `menu` order by `updated_at` desc limit 4
select * from `menu_picture` where `menu_picture`.`menu_id` in ('1', '2', '3', '4')
select * from `menu_type` where `menu_type`.`id` in ('1')
select * from `menu` order by `hits` desc limit 4
---
    public function store(Request $req, $type = 'all')
    {
        $searching = false;
        $text = $req->input('search');
        $typeId = $req->input('typeId');
        $tagId = $req->input('tagId');
        if ($typeId  >= 0 && !is_null($typeId )) {
            $searching = true;
            $type = 'search';
            $menus = Menu::with('menuPictures', 'menuType')
                ->whereHas('menuType', function ($q) use ($typeId) {
                    $compare = "=";
                    if($typeId == 0) $compare = ">";
                    $q->where('id', $compare, $typeId);
                })
                ->where('name', 'like', $text . '%')
                ->get();
        }elseif($tagId  >= 1 && !is_null($tagId )){
            $searching = true;
            $menus = Menu::with('menuPictures', 'menuType', 'tags')
                ->whereHas('tags', function ($q) use ($tagId) {
                    $q->where('id', '=', $tagId);
                })
                ->get();
        }else{
            $menus = Menu::with('menuPictures', 'menuType')
            ->whereHas('menuType', function ($q) use ($type) {
                $search = $type;
                if ($type == 'all') $search = '';
                $q->where('name', 'like', $search . '%');
            })
            ->paginate(9);
        }


        $new_menu = Menu::with('menuPictures', 'menuType')->orderBy('updated_at', 'desc')->take(4)->get();

        $top_menu = Menu::with('menuPictures', 'menuType')->orderBy('hits', 'desc')->take(4)->get();