app/Http/Controllers/UserBackController.php

select * from `users` limit 5 offset 0
select count(*) as aggregate from `users`
---
                break;

            default:
                $users = User::with('roles')->paginate(5);

select * from `roles`
select * from `provinces`
---
    public function addUser()
    {
        $roles = Role::all();
        $provinces = Province::all();

select * from `districts` where `districts`.`province_id` = '3' and `districts`.`province_id` is not null
---
    public function getDistrictsByProvinceId(Request $req)
    {
        $districts = [];
        $province_id = $req->input('province_id');
        if ($province_id <= 0 || !is_numeric($province_id)) {
            abort(404);
        }

        $query = Province::find($province_id)->districts;

select * from `sub_districts` where `sub_districts`.`district_id` = '62' and `sub_districts`.`district_id` is not null
---
    public function getSubDistrictsByProvinceId(Request $req)
    {
        $subDistricts = [];
        $district_id = $req->input('district_id');
        if ($district_id <= 0 || !is_numeric($district_id)) {
            abort(404);
        }

        $query = District::find($district_id)->subDistricts;