app/Http/Controllers/WhishListController.php

select * from `whish_list` where `whish_list`.`user_id` = '34' and `whish_list`.`user_id` is not null
---
    public function count(){
        $number = Menu::whereHas('whishLists', function ($q) {
                $q->where('user_id', '=', Auth::user()->id);
            })->count();

select count(*) as aggregate from `menu` where exists (select * from `whish_list` where `menu`.`id` = `whish_list`.`menu_id` and `user_id` = '34')
---
    public function whish(){
        $user_id = Auth::user()->id;
        $product = Menu::with('menuPictures', 'menuType')
        ->whereHas('whishLists', function ($q) use($user_id){
            $q->where('user_id', '=', $user_id);
        })
        ->paginate(9);